In [1]:
import mysql.connector

In [3]:
mydb = mysql.connector.connect(host = 'localhost',
                               user = 'root',
                               password = 'Girish_1234')
print(mydb.connection_id)

12

In [4]:
cur = mydb.cursor()

In [5]:
cur.execute("show databases")

In [6]:
for dbs in cur:
    print(dbs)

('athelete',)
('cx_db',)
('employees',)
('information_schema',)
('my_db',)
('mynewdb',)
('mysql',)
('new_students',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [8]:
cur.execute("create database mynewdb1")
print("mynewdbcreated")

mynewdbcreated

In [9]:
cur.execute("show databases")

In [10]:
for dbs in cur:
    print(dbs)

('athelete',)
('cx_db',)
('employees',)
('information_schema',)
('my_db',)
('mynewdb',)
('mynewdb1',)
('mysql',)
('new_students',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [12]:
#server => database => data table

mydb = mysql.connector.connect(host = "localhost",
                              user = "root",
                              password = "Girish_1234",
                              database = "mynewdb1")
cur = mydb.cursor()

In [13]:
s = "create table newbook(bookid int(4) , title varchar(20) , price float(5,2))"
cur.execute(s)
mydb.commit()
print("Data table Newbook is created in mynewdb to store data")

Data table Newbook is created in mynewdb to store data

In [14]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)

In [15]:
s = "insert into newbook (bookid,title,price) values(%s,%s,%s)"
value = (2,"HTML",150)
cur.execute(s,value)
print("value added into table")

value added into table

In [16]:
s = "select * from newbook"
cur.execute(s)
for row in cur:
    print(row)

(2, 'HTML', 150.0)

In [17]:
s = "insert into newbook (bookid,title,price) values (%s,%s,%s)"
value = [(3,"PHP",150),(4,"Java",100),(5,"Scala",160)]
cur.executemany(s,value)
print("Multiple values are added successfully")

Multiple values are added successfully

In [18]:
s = "select * from newbook"
cur.execute(s)
for row in cur:
    print(row)

(2, 'HTML', 150.0)
(3, 'PHP', 150.0)
(4, 'Java', 100.0)
(5, 'Scala', 160.0)

In [19]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 150.0), (3, 'PHP', 150.0), (4, 'Java', 100.0), (5, 'Scala', 160.0)]

In [20]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
for res in result:
    print(res)

(2, 'HTML', 150.0)
(3, 'PHP', 150.0)
(4, 'Java', 100.0)
(5, 'Scala', 160.0)

In [21]:
#write a query to increase price by 10

s = "update newbook set price = price + 10"
cur.execute(s)
print("Price values are updated")

Price values are updated

In [22]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (5, 'Scala', 170.0)]

In [23]:
#write a query to decrease price by 10% where it is more then 200

s = "update newbook set price = price * 0.9 where price > 200"
cur.execute(s)
print("Price values are updated")

Price values are updated

In [24]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (5, 'Scala', 170.0)]

In [25]:
#write a query to delete data sample representing "Scala"

s = "delete from newbook where title = 'Scala'"
cur.execute(s)
print("Sample Scala is deleted")

Sample Scala is deleted

In [26]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0)]

In [27]:
s = "insert into newbook (bookid,title,price) values (%s,%s,%s)"
values = [(3,'PHP',160),(3,'PHP',160)]
cur.executemany(s,values)

In [28]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0)]

In [29]:
#create a table newbook2 with all the values of newbook i.e. a copy of newbook

s = "create table newbook2 as select * from newbook"
cur.execute(s)

In [30]:
s = "select * from newbook2"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0), (3, 'PHP', 160.0), (3, 'PHP', 160.0)]

In [31]:
#create a table newbook3 with non repetitive values of newbook

s = "create table newbook3 as select distinct bookid,title,price from newbook"
cur.execute(s)

In [32]:
s = "select * from newbook3"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0), (3, 'PHP', 160.0), (4, 'Java', 110.0)]

In [33]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)
('newbook2',)
('newbook3',)

In [34]:
#write a query to delete table newbook2
s = "drop table newbook2"
cur.execute(s)

In [35]:
s = "show tables"
cur.execute(s)
for table in cur:
    print(table)

('newbook',)
('newbook3',)

In [36]:
#write a query to add a new coluwm quantity as integer value

s = "alter table newbook add column quantity int(4)"
cur.execute(s)
print('quanity column is added')

quanity column is added

In [37]:
s = "describe newbook"
cur.execute(s)

In [38]:
for cols in cur:
    print(cols)

('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [39]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0, None), (3, 'PHP', 160.0, None), (4, 'Java', 110.0, None), (3, 'PHP', 160.0, None), (3, 'PHP', 160.0, None)]

In [40]:
#add a new column between price and quantity

s = "alter table newbook add column sales float(7,2) after price"
cur.execute(s)

In [41]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [42]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(2, 'HTML', 160.0, None, None), (3, 'PHP', 160.0, None, None), (4, 'Java', 110.0, None, None), (3, 'PHP', 160.0, None, None), (3, 'PHP', 160.0, None, None)]

In [43]:
#add a new column skuid as first column

s = "alter table newbook add column skuid int first"
cur.execute(s)

In [44]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('skuid', 'int', 'YES', '', None, '')
('bookid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [45]:
s = "select * from newbook"
cur.execute(s)
result = cur.fetchall()
print(result)

[(None, 2, 'HTML', 160.0, None, None), (None, 3, 'PHP', 160.0, None, None), (None, 4, 'Java', 110.0, None, None), (None, 3, 'PHP', 160.0, None, None), (None, 3, 'PHP', 160.0, None, None)]

In [46]:
#delete the column bookid

s = "alter table newbook drop column bookid"
cur.execute(s)

In [47]:
s = "describe newbook"
cur.execute(s)

for cols in cur:
    print(cols)

('skuid', 'int', 'YES', '', None, '')
('title', 'varchar(20)', 'YES', '', None, '')
('price', 'float(5,2)', 'YES', '', None, '')
('sales', 'float(7,2)', 'YES', '', None, '')
('quantity', 'int', 'YES', '', None, '')

In [48]:
#insert a new data sample

s = "insert into newbook (skuid,title,price,sales,quantity) values (4,'C++',130,20000,)"